HirokiIshiguro/rx72n-envision-kit/Demos/cli/serial.c
/*
 * FreeRTOS V202211.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 * Modifications Copyright (C) 2023-2025 Renesas Electronics Corporation or its affiliates.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * https://www.FreeRTOS.org
 * https://github.com/FreeRTOS
 *
 */

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include <string.h>

/* Demo program includes. */
#include "serial.h"

/* Renesas includes. */
#include "platform.h"
#include "Pin.h"
#include "r_sci_rx_if.h"
#include "r_byteq_if.h"

#define U_SCI_UART_CLI_PINSET()  R_Pins_Create()


/* FreeRTOS CLI Command Console */
#if !defined(BSP_CFG_SCI_UART_TERMINAL_ENABLE)
#error "Error! Need to define MY_BSP_CFG_SERIAL_TERM_SCI in r_bsp_config.h"
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (0)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH0
#define U_SCI_UART_CLI_REG             SCI0
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (1)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH1
#define U_SCI_UART_CLI_REG             SCI1
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (2)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH2
#define U_SCI_UART_CLI_REG             SCI2
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (3)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH3
#define U_SCI_UART_CLI_REG             SCI3
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (4)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH4
#define U_SCI_UART_CLI_REG             SCI4
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (5)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH5
#define U_SCI_UART_CLI_REG             SCI5
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (6)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH6
#define U_SCI_UART_CLI_REG             SCI6
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (7)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH7
#define U_SCI_UART_CLI_REG             SCI7
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (8)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH8
#define U_SCI_UART_CLI_REG             SCI8
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (9)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH9
#define U_SCI_UART_CLI_REG             SCI9
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (10)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH10
#define U_SCI_UART_CLI_REG             SCI10
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (11)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH11
#define U_SCI_UART_CLI_REG             SCI11
#elif BSP_CFG_SCI_UART_TERMINAL_CHANNEL == (12)
#define U_SCI_UART_CLI_SCI_CH          SCI_CH12
#define U_SCI_UART_CLI_REG             SCI12
#else
#error "Error! Invalid setting for MY_BSP_CFG_SERIAL_TERM_SCI in r_bsp_config.h"
#endif

/* Characters received from the UART are stored in this queue, ready to be
received by the application.  ***NOTE*** Using a queue in this way is very
convenient, but also very inefficient.  It can be used here because characters
will only arrive slowly.  In a higher bandwidth system a circular RAM buffer or
DMA should be used in place of this queue. */
QueueHandle_t xRxQueue = NULL;

/* When a task calls vSerialPutString() its handle is stored in xSendingTask,
before being placed into the Blocked state (so does not use any CPU time) to
wait for the transmission to end.  The task handle is then used from the UART
transmit end interrupt to remove the task from the Blocked state. */
static TaskHandle_t xSendingTask = NULL;

/* Board Support Data Structures. */
sci_hdl_t xSerialSciHandle = 0;

extern char* txBuffer;

const TickType_t xMaxBlockTime = pdMS_TO_TICKS( 5000 );

static size_t txIndex = 0;

/* Used to guard access to the UART in case messages are sent to the UART from
more than one task. */
static SemaphoreHandle_t xTransmitMutex = NULL;
static SemaphoreHandle_t xOutCharMutex = NULL;

void CLI_Support_Settings(void);
void vSerialSciCallback( void *pvArgs );
void CLI_Close(void);


static sci_err_t prvEnsureSerialPortOpen( void )
{
    sci_cfg_t xSerialSciConfig;
    sci_err_t xOpenResult;

    if( 0 != xSerialSciHandle )
    {
        return SCI_SUCCESS;
    }

    U_SCI_UART_CLI_PINSET();
    memset( &xSerialSciConfig, 0, sizeof( xSerialSciConfig ) );
    xSerialSciConfig.async.baud_rate    = BSP_CFG_SCI_UART_TERMINAL_BITRATE;
    xSerialSciConfig.async.clk_src      = SCI_CLK_INT;
    xSerialSciConfig.async.data_size    = SCI_DATA_8BIT;
    xSerialSciConfig.async.parity_en    = SCI_PARITY_OFF;
    xSerialSciConfig.async.parity_type  = SCI_EVEN_PARITY;
    xSerialSciConfig.async.stop_bits    = SCI_STOPBITS_1;
    xSerialSciConfig.async.int_priority = 1;

    xOpenResult = R_SCI_Open( U_SCI_UART_CLI_SCI_CH,
                              SCI_MODE_ASYNC,
                              &xSerialSciConfig,
                              vSerialSciCallback,
                              &xSerialSciHandle );


    return xOpenResult;
}

void CLI_Support_Settings(void)
{
    ( void ) prvEnsureSerialPortOpen();

    /* Create the semaphore used to access the UART Tx. */
    xTransmitMutex = xSemaphoreCreateMutex();
    configASSERT( xTransmitMutex );

    /* Create the semaphore used to protect the transmit buffer */
    xOutCharMutex = xSemaphoreCreateMutex();
    configASSERT( xOutCharMutex );
}

void CLI_Close(void)
{
    if( 0 != xSerialSciHandle )
    {
        R_SCI_Close( xSerialSciHandle );
        xSerialSciHandle = 0;
    }
}

/* Callback function which is called from Renesas API's interrupt service routine. */
void vSerialSciCallback( void *pvArgs )
{
sci_cb_args_t *pxArgs = (sci_cb_args_t *)pvArgs;

    /* Renesas API has a built-in queue but we will ignore it.  If the queue is not
    full, a received character is passed with SCI_EVT_RX_CHAR event.  If the queue
    is full, a received character is passed with SCI_EVT_RXBUF_OVFL event. */
    if( SCI_EVT_RX_CHAR == pxArgs->event || SCI_EVT_RXBUF_OVFL == pxArgs->event )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;

        if( NULL == xRxQueue )
        {
            return;
        }

        /* Characters received from the UART are stored in this queue, ready to be
        received by the application.  ***NOTE*** Using a queue in this way is very
        convenient, but also very inefficient.  It can be used here because
        characters will only arrive slowly.  In a higher bandwidth system a circular
        RAM buffer or DMA should be used in place of this queue. */
        xQueueSendFromISR( xRxQueue, &pxArgs->byte, &xHigherPriorityTaskWoken );

        /* See http://www.freertos.org/xQueueOverwriteFromISR.html for information
        on the semantics of this ISR. */
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}


/******************************************************************************
 * Function Name: vOutputChar
 * Description  : BSP charput function (BSP_CFG_USER_CHARPUT_FUNCTION).
 *                Buffers characters and flushes on newline via interrupt-driven
 *                vSerialPutString.
 * Argument     : cOutChar - character to output
 * Return Value : None
 *****************************************************************************/
void vOutputChar(char cOutChar)
{
    if (xSemaphoreTake(xOutCharMutex, portMAX_DELAY) == pdPASS)
    {
        /* OVERFLOW GUARD: Check if the buffer is full (or near-full) */
        if (txIndex >= (SCI_CFG_CH5_TX_BUFSIZ * 5))
        {
            /* Force a flush now to free up the buffer space */
            vSerialPutString((signed char *)txBuffer, (unsigned short)txIndex);
            txIndex = 0;
        }

        /* Write the character (safe now that space is guaranteed) */
        txBuffer[txIndex++] = (char)cOutChar;

        if ((0x0D == txBuffer[txIndex - 1]) || (0x0A == txBuffer[txIndex - 1]))
        {
            vSerialPutString((signed char *)txBuffer, (unsigned short)txIndex);
            txIndex = 0;
        }

        xSemaphoreGive(xOutCharMutex);
    }
}

/* Function required in order to link UARTCommandConsole.c - which is used by
multiple different demo application. */
xComPortHandle xSerialPortInitMinimal( unsigned long ulWantedBaud, unsigned portBASE_TYPE uxQueueLength )
{
    ( void ) ulWantedBaud;
    ( void ) uxQueueLength;

    /* Characters received from the UART are stored in this queue, ready to be
    received by the application.  ***NOTE*** Using a queue in this way is very
    convenient, but also very inefficient.  It can be used here because
    characters will only arrive slowly.  In a higher bandwidth system a circular
    RAM buffer or DMA should be used in place of this queue. */
    xRxQueue = xQueueCreate( uxQueueLength, sizeof( char ) );
    configASSERT( xRxQueue );

    /* Set interrupt priority. (Other UART settings had been initialized in the
    src/smc_gen/general/r_cg_hardware_setup.c.) */
    uint8_t ucInterruptPriority = configMAX_SYSCALL_INTERRUPT_PRIORITY - 1;
    R_SCI_Control( xSerialSciHandle, SCI_CMD_SET_RXI_PRIORITY, ( void * ) &ucInterruptPriority );
    R_SCI_Control( xSerialSciHandle, SCI_CMD_SET_TXI_PRIORITY, ( void * ) &ucInterruptPriority );

    /* Only one UART is supported, so it doesn't matter what is returned
    here. */
    return 0;
}


/* Function required in order to link UARTCommandConsole.c - which is used by
multiple different demo application. */
void vSerialPutString(const signed char * pcString, unsigned short usStringLength )
{
    /* Only one port is supported. */

    {
        /* Ensure the calling task's notification state is not already
        pending. */
        xTaskNotifyStateClear( NULL );

        uint32_t str_length = usStringLength;
        uint16_t transmit_length = 0;
        sci_err_t sci_err = SCI_SUCCESS;
        const TickType_t xRetryDelay = ( pdMS_TO_TICKS( 1 ) > 0 ) ? pdMS_TO_TICKS( 1 ) : 1;
        TickType_t xLastProgress = xTaskGetTickCount();

        if ( xSemaphoreTake( xTransmitMutex, xMaxBlockTime ) == pdPASS )
        {
            while (str_length > 0)
            {
                R_SCI_Control(xSerialSciHandle, SCI_CMD_TX_Q_BYTES_FREE, &transmit_length);

                if (transmit_length > str_length)
                {
                    transmit_length = (uint16_t) str_length;
                }

                if (0 == transmit_length)
                {
                    if ((xTaskGetTickCount() - xLastProgress) >= xMaxBlockTime)
                    {
                        sci_err = SCI_ERR_INSUFFICIENT_SPACE;
                        break;
                    }
                    vTaskDelay(xRetryDelay);
                    continue;
                }

                sci_err = R_SCI_Send(xSerialSciHandle, (uint8_t *) pcString,
                                     transmit_length);

                if ((SCI_ERR_XCVR_BUSY == sci_err) || (SCI_ERR_INSUFFICIENT_SPACE == sci_err))
                {
                    if ((xTaskGetTickCount() - xLastProgress) >= xMaxBlockTime)
                    {
                        break;
                    }
                    vTaskDelay(xRetryDelay);
                    continue;
                }

                if (SCI_SUCCESS != sci_err)
                {
                    break;
                }

                str_length -= transmit_length;
                pcString += transmit_length;
                xLastProgress = xTaskGetTickCount();
            }

            /* Must ensure to give the mutex back. */
            xSemaphoreGive( xTransmitMutex );
        }

        if (SCI_SUCCESS != sci_err)
        {
            R_BSP_NOP(); //TODO error handling code
        }
        /* A breakpoint can be set here for debugging. */
        R_BSP_NOP();
    }
}

/* Function required in order to link UARTCommandConsole.c - which is used by
multiple different demo application. */
signed portBASE_TYPE xSerialGetChar( xComPortHandle pxPort, signed char *pcRxedChar, TickType_t xBlockTime )
{
    /* Only one UART is supported. */
    ( void ) pxPort;

    /* Return a received character, if any are available.  Otherwise block to
    wait for a character. */
    return xQueueReceive( xRxQueue, pcRxedChar, xBlockTime );
}

/* Function required in order to link UARTCommandConsole.c - which is used by
multiple different demo application. */
signed portBASE_TYPE xSerialPutChar( xComPortHandle pxPort, signed char cOutChar, TickType_t xBlockTime )
{
    /* Just mapped to vSerialPutString() so the block time is not used. */
    ( void ) xBlockTime;
    ( void ) pxPort;

    vSerialPutString( &cOutChar, sizeof( cOutChar ) );
    return pdPASS;
}
